#pragma once
#include <iostream>
#include <queue>
#include <stack>
#define SIZE 10		//размер матрицы смежности
using namespace std;
void BFS(int);
void DFS(int, vector<bool>&);

//матрица смежности
int adjacency_matrix[SIZE][SIZE] = {
	{0,1,0,0,1,0,0,0,0,0},
	{1,0,0,0,0,0,1,1,0,0},
	{0,0,0,0,0,0,0,1,0,0},
	{0,0,0,0,0,1,0,0,1,0},
	{1,0,0,0,0,1,0,0,0,0},
	{0,0,0,1,1,0,0,0,1,0},
	{0,1,0,0,0,0,0,1,0,0},
	{0,1,1,0,0,0,1,0,0,0},
	{0,0,0,1,0,1,0,0,0,1},
	{0,0,0,0,0,0,0,0,1,0}
};

//список ребер
int edge_list[11][2] = {
	{1,2},
	{1,5},
	{2,7},
	{2,8},
	{3,8},
	{4,6},
	{4,9},
	{5,6},
	{6,9},
	{7,8},
	{9,10}
};

//список смежности
int adjacency_list[SIZE][SIZE] = {
	{2, 5},
	{1, 7, 8},
	{8},
	{6, 9},
	{1, 6},
	{4, 5, 9},
	{2, 8},
	{2, 3, 7},
	{4, 6, 10},
	{9}
};